{"Buffs":{"title":"Buffs","links":["Stats","Items","Skills","Transformations"],"tags":[],"content":"List of Buffs\nCommon Buffs\nExpand\n\n\n                  \n                    Expand\n                  \n                \n\nThis buff has eight levels of mastery. You can choose which level to activate. Each level adds 10% Strength, Durability, and Resistance. Each level also reduces Speed, Offense, and Defense by 5%.\n\n\nFocus\n\n\n                  \n                    Focus\n                  \n                \n\nThis buff drains Energy based on mastery level. While this buff is active, the user gains 30% Force, and 50% Speed and Regeneration.\n\n\nMajin\n\n\n                  \n                    Majin\n                  \n                \n\nA racial buff for Demons. This buff adds 25% Battle Power and Offense. It also forcefully activates Anger, even if the user is not at their anger threshold.\n\n\nMystic\n\n\n                  \n                    Mystic\n                  \n                \n\nA racial buff for Kaios. This buff adds 15% Battle Power and 25% Recovery. It also stops power loss from low Health, halves the power loss from low Energy, and gives the user’s full Anger directly to their Battle Power, although it does not activate Anger directly. This buff also disables the user’s normal anger mechanic.\n\n\nThird Eye\n\n\n                  \n                    Third Eye\n                  \n                \n\nA racial buff for Humans. This buff adds 20% to the user’s highest Stat Mod, excluding Energy, Battle Power, and Anger. This buff also adds 10% to the user’s second highest Stat Mod. This buff checks the stat mods at the time of activation.\n\n\nOozaru\n\n\n                  \n                    Oozaru\n                  \n                \n\nA racial buff for Saiyans. This buff can only be activated by looking at a Full Moon or a similar Item. This buff adds 40% to Strength and Force, 60% to Durability and Resistance, and 15% to Battle Power. It also reduces Offense by 20%, Speed by 30%, and Defense by 40%. This buff also sets Maximum Stamina to 50 and gives you a large Hitbox and Attack area. This buff can only last 5 minutes, although the timer can be paused in certain scenarios. This buff also disables activating a Transformation.\n\n\nChangeling Forms\n\n\n                  \n                    Changeling Forms\n                  \n                \n\nA racial buff for Changelings. There are three types of Forms, listed below. The multipliers are per-level.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTypeLevelsBPStrengthDurabilityForceResistanceOffenseDefenseSpeedRecovery121.3––1.25–1.11.15––231.21.151.151.15–1.151.1––341.15––1.05–1.051.0751.11.075\n\n\nUnique Buffs\nKaioken\n\n\n                  \n                    Kaioken\n                  \n                \n\nThis buff changes the user’s Power Control skill. While active, powering up raises Kaioken’s level and powering down decreases it. Each level of Kaioken automatically sets the user’s powerup percentage to *201+((level-1)0.05)%, draining Health instead of Energy. Activating this buff halves the power loss from low Health. This buff also disables activating a Transformation.\n\n\nFlow State\n\n\n                  \n                    Flow State\n                  \n                \n\nThis buff summons a variable amount of intangible copies that follow the user’s movement. Each time the user attacks, the clones attack as well, with a delay dependent on the sequence number of the clone. The clones’ attacks have all the same stats and modifiers of the user. Each attack that a clone makes drains 5 Stamina.\n\n\nLimit Breaker\n\n\n                  \n                    Limit Breaker\n                  \n                \n\nThis buff removes all power loss from low Energy, adding an adjustable amount of power to the user’s powerup percentage.\n\n"},"Factions":{"title":"Factions","links":["tags/","tags/Tier","tags/AL"],"tags":["","Tier","AL"],"content":"Unlike other games of the style Factions are one of Final Revelations key systems. They allow for players to progress and earn skills and bonuses through activity. This effectively removes the need for staff to push out Ranks into the game.\n\nPerks\n(20 INFLUENCE)###\nBP Gains Boost - 5/5 - Raises your BP Gains Multiplier by 10%+ per level. \nEnergy Gains Boost - 5/5 - Raises your Energy Gains Multiplier by 10%+ per level. \nInjury Recovery - 5/5 - Recover injuries 10%+ faster per level while on your home planet. \nEnchant Cost - 5/5 - Cost Reduction for enchanting 3%+ per level. \nTraining Equip Cost - 10/10 - Cost Reduction for training items in particular. 5%+ per level. \nSpace Travel Cost - 10/10 - Cost Reduction for space related items in particular. 3%+ per level. \nMisc. Tech Cost - 10/10 - Cost Reduction for most technology. 5%+ per level. \nMagic Cost Reduction - 10/10 - Cost Reduction for most magic objects. 5%+ per level. \nResource Gain - 10/10 - While digging manually you gain 5%+ more resources per level. \nMana Gain - 10/10 - While meditating for mana you gain 3%+ per level.\n(MAJOR INFLUENCE)###\nNote: You gain 0.2+ Major Influence per perk you buy. \nBurglar - Deal 200% extra damage to player structures/buildings. (1 MI) \nHome Turf - While on your home planet you take 5% less damage. (2 MI) \nInvasion Bonus - While invading another planet you deal 5% more damage. (2 MI) \nTenacity Increase - Gives +15 Max Wounds for players on the faction’s home planet. (3 MI) \nAnger Percent - Anger activates for faction members at a higher % of health. (3 MI)\nFaction Tiers\nTier 1###\n\nTribe - 100% Influence Gains - 50 Total Influence to upgrade\n-Influence Shop- \nBlast (15) \nCharge (15) \nBeam (15) \nFly (15) \nShield (15) \nPower Control (25) \nCrash Punch (15)\n\nTier 2###\n\nMonarchy, Democracy &amp; Republic, Dictatorship, Cult - 150% Influence Gains - 200 Total Influence to upgrade\n-Influence Shop- \nLesser Teleport (50) \nHoming Finisher (100) \nKienzan (75) \nSokidan (75) \nRay (75) \nKamehameha (75) \nDodompa (75) \nKikoho (75) \nTaiyoken (50) \nChain Punching (25) \nGreat Divide (25) \nGalic Gun (75) \nSpear Twirl (15) \nSpear Jump (15) \nMasenko (75) \nPiercer (75) \n+All skills from the previous tier.\n\nTier 3###\n\nAristocracy, Oligarchy, Communism, Socialism, Theocracy - 200% Influence Gains - 750 Total Influence to upgrade\nSocialism gets 300% Influence Gains instead of the standard 200%, with the possible downside of everyone in the faction gaining the permission to buy perks and skills.\n-Influence Shop- \nMaterialization (100) \nInvisibility (50) \nMake Amulet (200) \nBind (125) \nRestore Youth (125) \nKeep Body (125) \nObserve (100) \nNote - All the aforementioned skills are Theocracy exclusives.\n+All skills from the previous tier.\n\nTier 4###\n\nUtopia, Grand Empire, Imperial Cult - 250% Influence Gains - \n-Influence Shop- \nFinal Flash (150) \nDeath Ball (150) \nUnlock Potential (450) (Imperial Cult) \n+All skills from the previous tier.\n\nAL Exclusive###\n\nAny Faction made within the afterlife gets exclusive skills to buy when they reach Tier 4, depending on where the faction was made within the afterlife (Home Turf) - \n-Influence Shop- \nMajin (Hell Faction) (300) \nMystic (Heaven Faction) (300) \nKaioken (Checkpoint Faction) (300) \n+All skills from the previous tier.\n"},"Items":{"title":"Items","links":[],"tags":[],"content":""},"Magic":{"title":"Magic","links":["Technology"],"tags":[],"content":"Magic is a system similar to Technology.\nSpells\nEnchantment\nEnchantment can only be used on weapons, giving them unique bonuses.\nAll enchantments are rolled randomly.\n1-3 random enchantment effects can be rolled on an item depending on the item Grade.\n\nCommon # Not Enchanted\nRare # 1 Enchantment\nSuper # 2 Enchantments\nLegendary # 3 Enchantments\n\nA player can spend mana to increase an item’s grade, which also increases the range of values for the enchantment effects.\nMana can be spent to imbue the item, which raises the values of all the enchantment effects the item currently possesses to the maximum possible value for that grade. An imbued item cannot be re-rolled or further modified.\n\nCosts are lowered by magic mod.\nBelow are a list of possible enchantments.\n\nPowerup Speed\nExtra Health\nExtra Stamina\nStamina Regeneration\nStamina Usage\nFatigue Resistance\nWound Resistance\nCritical Chance\nCharge Speed\nStun Chance\nBleed Chance\nResistance\nDurability\nKnockback Resistance\n\nBase Upgrade Costs:\n\nCommon → Rare # 100m\nRare → Super # 250m\nSuper → Legendary # 1b\n\nReroll Base Costs:\n\nRare # 5m\nSuper # 10m\nLegendary # 50m\n"},"Passives":{"title":"Passives","links":["Traits","Buffs"],"tags":[],"content":"A Passive is similar to a Trait, in that it gives passive bonuses to a character. The main difference is that a Passive cannot be leveled up, does not have a rank, and cannot be bought through Trait Points (TP), usually being unlocked through specific means. Passives are also not necessarily permanent.\nDark Energy\nA Demon’s racial passive. Increases Durability and Resistance by 20%, and reduces power loss from low energy by 30%.\nDivine Energy\nA Kaio’s racial passive. Increases Offense and Defense by 20%.\nWillpower\nAn Oni’s racial passive. Increases Regeneration by 3% for every 1% of Health missing.\nAnalysis\nA Tuffle’s racial passive. Provides a 25% chance on melee attacks to deal 150% of a character’s max damage roll.\nDemonoid Physiology\nA Makyo’s racial passive. Adjusts Expand to 12.5% Strength and Durability, 10% Resistance, and -3% Speed, Offense, and Defense per level.\nMovement Fluidity\nCompletely nullifies the effects of being slowed.\nKi Burn\n25% of Ki damage dealt is dealt again over 5 seconds.\nBerserk\nIncreases Battle Power by 2% for every 1% of Health missing.\nCounterpart\nAllows Namekian Fusion. All trait ranks are synced between the linked counterpart."},"Races":{"title":"Races","links":["Buffs","Transformations","Passives"],"tags":[],"content":"Human\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV1.71.32.31.51.51.41.752.432.551.91.7\nPassive: Third Eye\nTransformations:\n\nZenith\nPrime\n\n\nSaiyan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV21.51.751.31.3222.11.91.41.73\nPassive: Oozaru\nTransformations:\n\nSuper Saiyan\nSuper Saiyan 2\n\n\nNamekian\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV1.91.33.250.82.122.31.81.62.232\nPassive: Namekian Fusion, Counterpart\nTransformations:\n\nSuper Namekian\nSuper Namekian 2\n\n\nKaio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV21.32.81.13.251.651.522.22.31.82.75\nPassive: Divine Energy, Mystic\nTransformations:\n\nTenshinki\nAloakua\n\n\nDemon\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV21.41.932.522.31.81.511.41.5\nPassive: Dark Energy, Majin\nTransformations:\n\nMashinki\nTerror\n\n\nTuffle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV1.61.42.51.41.42.62.432.13.251.93\nPassive: Analysis\nTransformations:\n\nCodex\nEnervation\n\n\nChangeling\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV2.31.22.21.11.251.61.7211.222\nPassive: Changeling Forms\nTransformations:\n\nSub Zero\nPermafrost\n\n\nOni\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV1.9222.51.2221.61.61.21.71.3\nPassive: Willpower\nTransformations:\n\nVengeance\nHellion\n\n\nMakyo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCV21.41.81.61.41.71.42.621.52.41.9\nPassive: Demonoid Physiology\nTransformations:\n\nSerpentine\nRuination\n\n\nSummary Table\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRaceBPANGENGSTRFRCDURRESSPDOFFDEFRGNRCVHuman1.71.32.31.51.51.41.752.432.551.91.7Saiyan21.51.751.31.3222.11.91.41.73Namekian1.91.33.250.82.122.31.81.62.232Kaio21.32.81.13.251.651.522.22.31.82.75Demon21.41.932.522.31.81.511.41.5Tuffle1.61.42.51.41.42.62.432.13.251.93Changeling2.31.22.21.11.251.61.7211.222Oni1.9222.51.2221.61.61.21.71.3Makyo1.61.41.71.42.621.52.41.9"},"Skills":{"title":"Skills","links":["Traits","Factions","Stats"],"tags":[],"content":"Skills are active abilities that do not adjust stat mods. Skills are often used in combat, but there are a number of utility skills that have different situational uses. Skills can be learned through Traits, Factions, or by learning from someone who has the skill.\nBasic Skills\nBlast\nDamage Type: Energy\nA basic ranged ki blast. Uses a small amount of stamina.\nCharge\nDamage Type: Energy\nA chargeable ki blast. Deals damage based off of how long the user charges. Slower moving.\nBeam\nDamage Type: Energy\nA basic beam. Can be charged to deal more damage.\nKi Blade\nAdjusts the melee attack damage formula from 80% Strength / 20% Forceto 80% Force/ 20% Strength. Changes melee attack damage type to Energy.\nDash\nUsing this skill moves the user very swiftly in the direction they are moving. Drains stamina.\nRush\nUsing this skill moves the user very swiftly towards their target. Drains more stamina than Dash.\nFly\nAllows flying movement, bypassing obstacles. When trained, this skill is faster than running.\nPower Control\nAllows the user to control their level of power, increasing or decreasing their Battle Power. Powering up drains energy and is broken up into Tiers. The boundaries of these tiers are called Breakpoints. The user can power up beyond these breakpoints, which raises the tier of the power up. The base energy drain is multiplied by the tier. A character’s breakpoints are determined by their Recovery, and the speed at which a character powers up is determined by their Speed. This skill also allows the user to power down in order to spar with weaker characters or hide their presence.\nUtility Skills\nMaterialization\nAllows the user to create weights based on their max Energy. A fully weighted character has doubled Battle Power gains when training.\nTelepathy\nAllows the user to communicate directly in another character’s mind, even across vast distances.\nCombat Skills\nZanzoken\nAllows the use Warp combos. A Warp combo can be activated by pressing Attack while your target is being knocked back. Warp combo damage is based on the user’s Speed. Each point of speed equals 10% damage.\nDragon Rush\nAllows the user to dash towards a specified target, dealing 20% damage on contact and allowing an immediate follow up attack.\nCrash Punch\nInitiates a charging animation. Attack is released and dashes towards the target when the skill is used once again or if stamina depletes completely. Rapidly depletes stamina in exchange for increasing the damage incrementally by 0.25+ each tick. (1, 1.25, 1.5, and so on)"},"Stats":{"title":"Stats","links":["Buffs","Transformations","Traits"],"tags":[],"content":"Stats represent the basic fighting abilities of a character. Each stat has a Stat Modifier, or Stat Mod associated with it, which multiplies the stat’s effectiveness. There are trainable stats and non-trainable stats. Trainable stats can be raised by performing different training activities. Non-trainable stats cannot normally be raised, but their stat mods adjusted by Buffs, Transformations, and in some cases Traits. Raising any trainable stat gives the character Trait Points (TP), which can be used to raise Trait ranks.\nStat Descriptions\nBasic Stats\nHealth\nHealth represents a character’s current vitality. If Health reaches 0, the character is knocked out.\nStamina\nStamina is the main resource your character utilizes for skills, blocking, attacking, or movement techniques. Stamina regenerates passively. Any attack action performed by a character will stop their Stamina regeneration for 1 second. At 0 Stamina, a character is slowed down until their Stamina regenerates.\nWounds\nWounds represent the long-term battle damage of a character. A character’s Health cannot exceed their Wounds. When a character takes damage, they lose at base 10% of that damage in Wounds. So long as a character is above 15% wounds, they can join combat. If a character is below 5% wounds and knocked out while in combat, they will stay down until the combat is finished.\nFatigue\nFatigue is the long-term exhaustion of a character. A character’s Energy cannot exceed their Fatigue. Fatigue cannot be regenerated in combat.  When a character expends Energy, they lose at base 10% of that energy in Fatigue.\nTrainable Stats\nStrength\nStrength largely influences the power of Physical attacks. It also factors into the weight a character can carry.\nDurability\nDurability largely influences damage taken from Physical attacks. It also factors into the weight a character can carry.\nForce\nForce largely influences the power of Ki attacks.\nResistance\nResistance largely influences damage taken from Ki attacks.\nOffense\nOffense determines the accuracy of a character’s attacks.\nDefense\nDefense determines the rate at which a character dodges.\nEnergy\nEnergy determines the total amount of energy a character has, which is drained from many buffs and skills. Training this stat does not give the character Trait Points.\nBattle Power\nBattle Power is a multiplier for each stat and determines how effective a stat is. Training this stat does not give the character Trait Points.\nNon-Trainable Stats\nSpeed\nSpeed affects a character’s attack rate, movement speed, charge rate, power-up rate, and the damage of speed-based skills.\nRegeneration\nRegeneration determines the rate at which a character heals Health and Wounds, and how long it takes for them to get up after being knocked out.\nRecovery\nRecovery determines the rate at which a character heals Energy and Fatigue, the energy drain of certain skills and buffs, and the power-up breakpoint percentage for each power-up tier.\nAnger\nAnger is a multiplier on top of Battle Power, typically activated when under 50% Health, although many Skills, Buffs, or Traits can affect how it activates."},"Technology":{"title":"Technology","links":[],"tags":[],"content":""},"Traits":{"title":"Traits","links":["Transformation","Skills","Races","Traits","Buffs"],"tags":[],"content":"Traits are passive modifiers that a character can achieve. They can be leveled up using Trait Points (TP) to increase the Rank of a trait. Most traits have 24 ranks (F- to A+, S- to S+, SS, SSS, God), but certain traits like Transformation traits have a variable number of ranks. Traits may also unlock Skills when a prerequisite is met.\nProwess Traits are a type of trait that can be unlocked through leveling up other traits. These are often much more powerful than a normal trait and can greatly affect the playstyle of a character.\nNormal Traits\nDash\nAffects the character’s dashing stamina cost, reducing it by 2.5% per rank. At rank C-, the character learns Zanzoken.\nMeditation\nEach rank increases Battle Power gained from Meditation by 10%. At rank E- for Humans, Namekians, and Kaio, or rank E for all other races, the character learns the Ki Manipulation trait. At rank D, the character learns Materialization, and at rank C-, the character learns Telepathy.\nKi Manipulation\nEach rank reduces charge time and fatigue loss by 3%. Rank F- teaches Ki Blade, rank F teaches Blast, rank F+ teaches Charge, rank E- teaches Beam, rank E teaches Fly, rank E+ teaches Power Control, and rank D- teaches Focus.\nFighting Spirit\nEach rank increases the maximum damage roll of melee attacks by 3.5%. Saiyans raise this trait 50% faster. At rank E for Humans and Namekians, and rank D- for other races, the character learns Martial Arts trait.\nMartial Arts\nEach rank increases the minimum damage roll of melee attacks by 3.5%. At rank D-, the character learns Expand. This Trait can be learned from players that already have it.\nResolve\nEach rank decreases all damage taken by 0.5% and decreases wounds damage by 1.5%. Oni and Changelings raise this trait 50% faster, while Namekians raise it 20% slower. Rank F+ teaches Block.\nFlying\nThis trait has a max rank of B+. Each rank increases flying speed by 10%. If this trait is at least rank F+, the character can perform a Dragon Rush.\nStyle Traits\nTraits in this section all grant a 0.5% increase in damage at every rank while using the specific style.\nUnarmed\nD- rank you receive Crash Punch.\nC- rank you receive Whirlwind Kick.\nC+ rank you receive Piledriver.\nC+ rank you will receive a choice of unarmed fighting style. (A permanent choice)\nHere is a description of the current fighting styles:\n\nDefault: Regular attack. No modifiers.\nLight: 1 attack, 0.3x damage, 0.3x cooldown, 0.25x knockback, 4 active frames\nMedium: 3 attacks. First is the same as light, second is a flip kick with 0.5x damage and 0.5x knockback, with 6 active frames. Third attack is 1x damage, 1.5x knockback, 8 active frames.\nHeavy: 2 attacks. First is 0.5x damage with 0.25x cooldown, 3 active frames. Second is 0.5x damage, 4x knockback, 3 active frames. Both have 30 pixel hitboxes instead of 20 pixel hitboxes like the rest of the attacks.\n\nSword\nE rank you receive Great Divide.\nB- rank you will receive Iai.\nDragoon\nE rank you receive Spear Jump.\nC- rank you will receive Spear Twirl.\nProwess Traits\nGrit\nWhile standing still, take 2% less damage per rank, but also deal 2% less damage per rank.\nWind Up\nFor every second not attacking, gain an 8% boost to melee damage per rank. This bonus caps at 3 seconds.\nBraced Blast\nEvery rank increases blast damage by 8%, but decreases blast speed by 3%.\nSensei\nEvery rank increases teaching point gain by 10%.\nTransformation Traits\nSuper Saiyan\nThe transformation trait for Saiyans.\nDivinity\nThe transformation trait for Kaio.\nMalevolence\nThe transformation trait for Demons.\nNemesis\nThe transformation trait for Oni.\nQuintessence\nThe transformation trait for Changelings.\nSuper Namekian\nThe transformation trait for Namekians.\nEthos\nThe transformation trait for Humans.\nParadigm\nThe transformation trait for Tuffles.\nMesomorph\nThe transformation trait for Makyos."},"Transformations":{"title":"Transformations","links":["Buffs","Stats"],"tags":[],"content":"A Transformation is a special type of Buff that is almost always unique to a race. Transformations typically have modifiers and abilities that are far beyond even Unique buffs. Each race has at least one transformation. Some races have a permanent transformed state, while others have a temporary toggleable transformation.\nTo achieve a transformation, a character has to meet the required Battle Power and be able to power up to meet the transformation tier. For example, Super Saiyan - a Tier 1 transformation - requires reaching past a character’s first powerup breakpoint in order to transform. When a transformation is mastered, this requirement is no longer necessary.\nTransformations\nGiji\nGiji transformations are Tier 0. They are often only applicable to certain battles and act mostly as precursors to full transformations. In some cases, a Giji transformation is required to achieve a full transformation. Giji transformations add 35% Battle Power and do not provide any other passive modifiers.\nSaiyan\nSuper Saiyan\nTier: 1 \nBattle Power Modifier: +150%\nPassive: Doubles breakpoint percentages for Power Control.\nSuper Saiyan 2\nTier: 2\nBattle Power Modifier: +200%\nPassive: +50% Speed\nHuman\nZenith\nTier: 1\nBattle Power Modifier: +150%\nPassive: Upon missing a melee attack, attempt to attack one more time. The second attack’s damage is halved.\nPrime\nTier: 2\nBattle Power Modifier: +200%\nPassive: The negative effects of Buffs are halved.\nNamekian\nSuper Namekian\nPermanent\nTier: 1\nBattle Power Modifier: +150%\nPassive: 20% Stamina drain reduction.\nSuper Namekian 2\nTier: 2\nBattle Power Modifier: +200%\nPassive: Upon failing to dodge, attempt to dodge one more time to reduce the attack’s damage by 25%.\nTuffle\nCodex\nTier: 1\nBattle Power Modifier: +150%\nPassive: Each attack that lands on an opponent adds a stack of Codex, maxing out at 3. Upon reaching the max, all stacks are consumed and deal un-dodgeable damage equal to half a normal attack roll with modifiers, with 20% more damage for each stack.\nEnervation\nTier: 2\nBattle Power Modifier: +200%\nPassive: Codex stacks now deal their damage when applied.\nKaio\nTenshinki\nTier: 1\nBattle Power Modifier: +150%\nPassive: Ki attacks burn the opponent for 25% of their damage over 5 seconds.\nAloakua\nTier: 2\nBattle Power Modifier: +200%\nPassive: The user can no longer have their movement negatively modified.\nDemon\nMashinki\nTier: 1\nBattle Power Modifier: +150%\nPassive: 25% of damage dealt is gained as Health.\nTerror\nTier: 2\nBattle Power Modifier: +200%\nPassive: Melee attacks drain 10 Stamina from the opponent.\nOni\nHellion\nTier: 1\nBattle Power Modifier: +150%\nPassive: Above 50% Health, 25% increase Durability, Resistance, and Defense. Below 50% Health, 50% increased Speed, and 25% increased Offense and Strength.\nVengeance\nTier: 2\nBattle Power Modifier: +200%\nPassive: Upon a successful Melee attack, increase target’s Power Up drain by 50% for 3 seconds.\nChangeling\nSub Zero\nTier: 1\nBattle Power Modifier: +150%\nPassive: The user emits an aura around them that slows opponents by 25%.\nPermafrost\nTier: 2\nBattle Power Modifier: +200%\nPassive: Damaged enemies have their stamina costs doubled for 2 seconds.\nMakyo\nSerpentine\nPermanent\nTier: 1\nBattle Power Modifier: +150%\nPassive: +0.3 to Anger mod. 15% reduced Fatigue and Wounds gain.\nRuination\nPermanent\nTier: 2\nBattle Power Modifier: +200%\nPassive: TBA"},"index":{"title":"Final Revelations Wiki","links":["Stats","Races","Traits","Skills","Buffs","Factions","Items","Magic","Technology"],"tags":[],"content":"Final Revelations is a Dragonball-themed Roleplaying game on the BYOND platform that has been active since July 23, 2017.\nBelow is a list of useful pages with more information about the game.\n「Stats」 「Races」 「Traits」 「Skills」 「Buffs」 「Factions」 「Items」 「Magic」 「Technology」"}}